{
  "plugins": {
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp"
    },
    "blink.lib": {
      "src": "https://github.com/saghen/blink.lib"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "codesettings": {
      "src": "https://github.com/mrjones2014/codesettings.nvim"
    },
    "colorful-menu": {
      "src": "https://github.com/xzbdmw/colorful-menu.nvim"
    },
    "conform": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "copilot": {
      "src": "https://github.com/zbirenbaum/copilot.lua"
    },
    "crates": {
      "src": "https://github.com/saecki/crates.nvim"
    },
    "fff.nvim": {
      "src": "https://github.com/dmtrKovalenko/fff.nvim"
    },
    "fidget": {
      "src": "https://github.com/j-hui/fidget.nvim"
    },
    "flash": {
      "src": "https://github.com/folke/flash.nvim"
    },
    "gitsigns": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "grug-far": {
      "src": "https://github.com/MagicDuck/grug-far.nvim"
    },
    "harpoon": {
      "src": "https://github.com/theprimeagen/harpoon",
      "version": "'harpoon2'"
    },
    "lualine": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "mini.ai": {
      "src": "https://github.com/nvim-mini/mini.ai"
    },
    "mini.icons": {
      "src": "https://github.com/nvim-mini/mini.icons"
    },
    "mini.pairs": {
      "src": "https://github.com/nvim-mini/mini.pairs"
    },
    "mini.surround": {
      "src": "https://github.com/nvim-mini/mini.surround"
    },
    "nvim-jump": {
      "src": "https://github.com/yorickpeterse/nvim-jump"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects"
    },
    "oil": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "overseer": {
      "src": "https://github.com/stevearc/overseer.nvim"
    },
    "persistence": {
      "src": "https://github.com/folke/persistence.nvim"
    },
    "plenary": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "render-markdown": {
      "src": "https://github.com/MeanderingProgrammer/render-markdown.nvim"
    },
    "rustaceanvim": {
      "src": "https://github.com/mrcjkb/rustaceanvim"
    },
    "sidekick": {
      "src": "https://github.com/folke/sidekick.nvim"
    },
    "snacks": {
      "src": "https://github.com/folke/snacks.nvim"
    },
    "splitjoin": {
      "src": "https://github.com/bennypowers/splitjoin.nvim"
    },
    "tiny-cmdline": {
      "src": "https://github.com/rachartier/tiny-cmdline.nvim"
    },
    "todo-comments": {
      "src": "https://github.com/folke/todo-comments.nvim"
    },
    "trouble": {
      "src": "https://github.com/folke/trouble.nvim"
    },
    "ts-comments": {
      "src": "https://github.com/folke/ts-comments.nvim"
    },
    "which-key": {
      "src": "https://github.com/folke/which-key.nvim"
    }
  }
}
